app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 23 Dec 2016 10:51:23 UTC +00:00], ["text", nil], ["title", nil], ["updated_at", Fri, 23 Dec 2016 10:51:23 UTC +00:00]]
---
  def create
    @article = Article.new(params[:article])
    if @article.save

SELECT "articles".* FROM "articles"
---
  def show
   @articles= Article.all